{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-AADHAAR",
    "2": "B-PAN",
    "3": "B-ACCOUNT_NO",
    "4": "B-IFSC",
    "5": "B-UPI_ID",
    "6": "B-PHONE",
    "7": "B-EMAIL",
    "8": "B-DOB",
    "9": "B-PASSPORT",
    "10": "B-PERSON",
    "11": "I-AADHAAR",
    "12": "I-PAN",
    "13": "I-ACCOUNT_NO",
    "14": "I-IFSC",
    "15": "I-UPI_ID",
    "16": "I-PHONE",
    "17": "I-EMAIL",
    "18": "I-DOB",
    "19": "I-PASSPORT",
    "20": "I-PERSON"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-AADHAAR": 1,
    "B-ACCOUNT_NO": 3,
    "B-DOB": 8,
    "B-EMAIL": 7,
    "B-IFSC": 4,
    "B-PAN": 2,
    "B-PASSPORT": 9,
    "B-PERSON": 10,
    "B-PHONE": 6,
    "B-UPI_ID": 5,
    "I-AADHAAR": 11,
    "I-ACCOUNT_NO": 13,
    "I-DOB": 18,
    "I-EMAIL": 17,
    "I-IFSC": 14,
    "I-PAN": 12,
    "I-PASSPORT": 19,
    "I-PERSON": 20,
    "I-PHONE": 16,
    "I-UPI_ID": 15,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
